/*
Умова: Напишіть гру в консолі «Хрестики-Нолики».
В цій грі має бути заставка, головне меню.
Також має бути вибір, чи гравець проти гравця, чи комп’ютер проти гравця.
В першому варіанті кожний гравець задає своє ім’я.
Перший гравець вибирає, чим буде ходити (хрестиками чи ноликами).
Другий гравець отримає те, що залишиться. Гра вибирає рандомно, хто перший ходить.
Реалізуйте логіку гри на полі 3 на 3.
Можлива ніч’я, тому результат гри також має бути у вигляді «виграв цей чи цей», або «нічья».
У випадку гри з комп’ютером реалізуйте штучний інтелект. Має бути 3 рівня складності:
Легкий: комп’ютер просто рандомно вибирає пусту клітинку;
Середній: комп’ютер аналізує, чи гравець зараз може виграти (стоїть два знаки і може бути третій в ряд/діагональ/стовпчик).
Якщо так – то ставить блок. Інакше вибирає рандомно.
Важкий: в комп’ютера виграти не можна, якщо ви ходите перші.
Якщо ходить він, то він грає лише по встановленій схемі, із якої ви можете вибратись максимум в нічью.
Врахувати всі можливі помилки зі сторони користувача (введе на ворожу клітинку чи на свою, введете за границі поля і т.д.).
Ви уже довго пишете функції і приблизно маєте уже розуміти, що якщо є алгоритм для виконання якоїсь дії, який складається з декількох рядків коду – то це має бути функція.
Прототипи функцій зберігайте в заголовковому файлі, їх реалізацію в .cpp файлі, а головний код (який викликає це все) в файлі main.cpp.
*/

#include <iostream>
#include <ctime>

using namespace std;



int main()
{
	int choiceInMenu;
	cout << "Main menu\n";
	cout << "Make the choice how you want to play: ";
	cout << " 1 - player against player\n";
	cout << " 2 - computer against player\n";
	cout << " 0 - exit";
	cin >> choiceInMenu;
	do
	{
		switch (choiceInMenu)
		{
		case 1:

			break;
		case 2:

			break;
		case 0:
			cout << "Goodbay!!!\n";
			break;
		default:
			cout << "Error, select an item from the menu\n";
			break;
		}
	} while (choiceInMenu != 0);
	return 0;
}